; domain
(define (domain satellite)
  (:requirements :typing :fluents :equality)
 (:types satellite direction instrument mode)
 (:predicates 
               (on_board ?i - instrument ?s - satellite)
	       (supports ?i - instrument ?m - mode)
	       (pointing ?s - satellite ?d - direction)
	       (power_avail ?s - satellite)
	       (power_on ?i - instrument)
	       (calibrated ?i - instrument)
	       (have_image ?d - direction ?m - mode)
	       (calibration_target ?i - instrument ?d - direction))
 
 

  (:functions (data_capacity ?s - satellite)
	      (data ?d - direction ?m - mode)
		(slew_time ?a ?b - direction)
		(data-stored)
		(fuel ?s - satellite)
		(fuel-used)
  )

  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev)
                   (not (= ?d_new ?d_prev))
		(>= (fuel ?s) (slew_time ?d_new ?d_prev))
              )
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))
		(decrease (fuel ?s) (slew_time ?d_new ?d_prev))
		(increase (fuel-used) (slew_time ?d_new ?d_prev))
           )
  )

 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
 
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s)
                 )
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))
           )
          
  )

 
  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
 
   :precondition (and (on_board ?i ?s)
                      (power_on ?i) 
                  )
   :effect (and (not (power_on ?i))
                (power_avail ?s)
           )
  )

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i)
                  )
   :effect (calibrated ?i)
  )
 

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d)
                      (power_on ?i)
			  (>= (data_capacity ?s) (data ?d ?m))
               )
   :effect (and (decrease (data_capacity ?s) (data ?d ?m)) (have_image ?d ?m)
		(increase (data-stored) (data ?d ?m)))
  )
)

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	satellite1 - satellite
	instrument1 - instrument
	instrument2 - instrument
	thermograph0 - mode
	spectrograph1 - mode
	thermograph3 - mode
	infrared2 - mode
	Star1 - direction
	GroundStation4 - direction
	GroundStation3 - direction
	GroundStation0 - direction
	Star2 - direction
	Phenomenon5 - direction
	Star6 - direction
	Star7 - direction
	Planet8 - direction
)
(:init
	(supports instrument0 thermograph0)
	(supports instrument0 spectrograph1)
	(supports instrument0 infrared2)
	(calibration_target instrument0 GroundStation3)
	(on_board instrument0 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Star6)
	(= (data_capacity satellite0) 1000)
	(= (fuel satellite0) 151)
	(supports instrument1 spectrograph1)
	(supports instrument1 infrared2)
	(calibration_target instrument1 GroundStation0)
	(supports instrument2 infrared2)
	(supports instrument2 thermograph3)
	(calibration_target instrument2 Star2)
	(on_board instrument1 satellite1)
	(on_board instrument2 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Star7)
	(= (data_capacity satellite1) 1000)
	(= (fuel satellite1) 112)
	(= (data Phenomenon5 thermograph0) 180)
	(= (data Star6 thermograph0) 110)
	(= (data Star7 thermograph0) 119)
	(= (data Planet8 thermograph0) 204)
	(= (data Phenomenon5 spectrograph1) 164)
	(= (data Star6 spectrograph1) 67)
	(= (data Star7 spectrograph1) 115)
	(= (data Planet8 spectrograph1) 140)
	(= (data Phenomenon5 thermograph3) 157)
	(= (data Star6 thermograph3) 69)
	(= (data Star7 thermograph3) 3)
	(= (data Planet8 thermograph3) 207)
	(= (data Phenomenon5 infrared2) 26)
	(= (data Star6 infrared2) 240)
	(= (data Star7 infrared2) 50)
	(= (data Planet8 infrared2) 44)
	(= (slew_time Star1 GroundStation0) 49.2)
	(= (slew_time GroundStation0 Star1) 49.2)
	(= (slew_time GroundStation4 GroundStation0) 40.99)
	(= (slew_time GroundStation0 GroundStation4) 40.99)
	(= (slew_time GroundStation4 Star1) 90.68)
	(= (slew_time Star1 GroundStation4) 90.68)
	(= (slew_time GroundStation4 Star2) 48.17)
	(= (slew_time Star2 GroundStation4) 48.17)
	(= (slew_time GroundStation4 GroundStation3) 28.25)
	(= (slew_time GroundStation3 GroundStation4) 28.25)
	(= (slew_time GroundStation3 GroundStation0) 1.327)
	(= (slew_time GroundStation0 GroundStation3) 1.327)
	(= (slew_time GroundStation3 Star1) 40.14)
	(= (slew_time Star1 GroundStation3) 40.14)
	(= (slew_time GroundStation3 Star2) 55.61)
	(= (slew_time Star2 GroundStation3) 55.61)
	(= (slew_time Star2 GroundStation0) 4.354)
	(= (slew_time GroundStation0 Star2) 4.354)
	(= (slew_time Star2 Star1) 11.72)
	(= (slew_time Star1 Star2) 11.72)
	(= (slew_time Phenomenon5 GroundStation0) 10.35)
	(= (slew_time GroundStation0 Phenomenon5) 10.35)
	(= (slew_time Phenomenon5 Star1) 21.18)
	(= (slew_time Star1 Phenomenon5) 21.18)
	(= (slew_time Phenomenon5 Star2) 39.13)
	(= (slew_time Star2 Phenomenon5) 39.13)
	(= (slew_time Phenomenon5 GroundStation3) 58.49)
	(= (slew_time GroundStation3 Phenomenon5) 58.49)
	(= (slew_time Phenomenon5 GroundStation4) 31.63)
	(= (slew_time GroundStation4 Phenomenon5) 31.63)
	(= (slew_time Star6 GroundStation0) 66.57)
	(= (slew_time GroundStation0 Star6) 66.57)
	(= (slew_time Star6 Star1) 2.571)
	(= (slew_time Star1 Star6) 2.571)
	(= (slew_time Star6 Star2) 47.13)
	(= (slew_time Star2 Star6) 47.13)
	(= (slew_time Star6 GroundStation3) 40.84)
	(= (slew_time GroundStation3 Star6) 40.84)
	(= (slew_time Star6 GroundStation4) 38.25)
	(= (slew_time GroundStation4 Star6) 38.25)
	(= (slew_time Star6 Phenomenon5) 17.41)
	(= (slew_time Phenomenon5 Star6) 17.41)
	(= (slew_time Star7 GroundStation0) 30.88)
	(= (slew_time GroundStation0 Star7) 30.88)
	(= (slew_time Star7 Star1) 29.38)
	(= (slew_time Star1 Star7) 29.38)
	(= (slew_time Star7 Star2) 3.721)
	(= (slew_time Star2 Star7) 3.721)
	(= (slew_time Star7 GroundStation3) 30.47)
	(= (slew_time GroundStation3 Star7) 30.47)
	(= (slew_time Star7 GroundStation4) 20.38)
	(= (slew_time GroundStation4 Star7) 20.38)
	(= (slew_time Star7 Phenomenon5) 47.2)
	(= (slew_time Phenomenon5 Star7) 47.2)
	(= (slew_time Star7 Star6) 37.67)
	(= (slew_time Star6 Star7) 37.67)
	(= (slew_time Planet8 GroundStation0) 1.439)
	(= (slew_time GroundStation0 Planet8) 1.439)
	(= (slew_time Planet8 Star1) 43.81)
	(= (slew_time Star1 Planet8) 43.81)
	(= (slew_time Planet8 Star2) 5.226)
	(= (slew_time Star2 Planet8) 5.226)
	(= (slew_time Planet8 GroundStation3) 44.54)
	(= (slew_time GroundStation3 Planet8) 44.54)
	(= (slew_time Planet8 GroundStation4) 43.37)
	(= (slew_time GroundStation4 Planet8) 43.37)
	(= (slew_time Planet8 Phenomenon5) 50.78)
	(= (slew_time Phenomenon5 Planet8) 50.78)
	(= (slew_time Planet8 Star6) 1.017)
	(= (slew_time Star6 Planet8) 1.017)
	(= (slew_time Planet8 Star7) 46.97)
	(= (slew_time Star7 Planet8) 46.97)
	(= (data-stored) 0)
	(= (fuel-used) 0)
)
(:goal (and
	(have_image Phenomenon5 thermograph0)
	(have_image Star6 infrared2)
	(have_image Star7 thermograph0)
	(have_image Planet8 infrared2)
))
(:metric minimize (fuel-used))

)

; plan
1. (turn_to satellite0 groundstation0 star6)
   deleted: (pointing satellite0 star6)
   added: (pointing satellite0 groundstation0)
   changed: (fuel satellite0) from 151 to 84.43, (fuel-used) from 0 to 66.57
   goals met: 0 of 4
2. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 0 of 4
3. (turn_to satellite0 groundstation3 groundstation0)
   deleted: (pointing satellite0 groundstation0)
   added: (pointing satellite0 groundstation3)
   changed: (fuel satellite0) from 84.43 to 83.103, (fuel-used) from 66.57 to 67.897
   goals met: 0 of 4
4. (turn_to satellite0 groundstation0 groundstation3)
   deleted: (pointing satellite0 groundstation3)
   added: (pointing satellite0 groundstation0)
   changed: (fuel satellite0) from 83.103 to 81.776, (fuel-used) from 67.897 to 69.224
   goals met: 0 of 4
5. (turn_to satellite0 groundstation3 groundstation0)
   deleted: (pointing satellite0 groundstation0)
   added: (pointing satellite0 groundstation3)
   changed: (fuel satellite0) from 81.776 to 80.449, (fuel-used) from 69.224 to 70.551
   goals met: 0 of 4
6. (calibrate satellite0 instrument0 groundstation3)
   added: (calibrated instrument0)
   goals met: 0 of 4
7. (turn_to satellite0 star6 groundstation3)
   deleted: (pointing satellite0 groundstation3)
   added: (pointing satellite0 star6)
   changed: (fuel satellite0) from 80.449 to 39.609, (fuel-used) from 70.551 to 111.391
   goals met: 0 of 4
8. (take_image satellite0 star6 instrument0 infrared2)
   added: (have_image star6 infrared2)
   changed: (data_capacity satellite0) from 1000 to 760, (data-stored) from 0 to 240
   goals met: 1 of 4
9. (turn_to satellite0 planet8 star6)
   deleted: (pointing satellite0 star6)
   added: (pointing satellite0 planet8)
   changed: (fuel satellite0) from 39.609 to 38.592, (fuel-used) from 111.391 to 112.408
   goals met: 1 of 4
10. (take_image satellite0 planet8 instrument0 infrared2)
   added: (have_image planet8 infrared2)
   changed: (data_capacity satellite0) from 760 to 716, (data-stored) from 240 to 284
   goals met: 2 of 4
11. (turn_to satellite0 groundstation0 planet8)
   deleted: (pointing satellite0 planet8)
   added: (pointing satellite0 groundstation0)
   changed: (fuel satellite0) from 38.592 to 37.153, (fuel-used) from 112.408 to 113.847
   goals met: 2 of 4
12. (turn_to satellite0 phenomenon5 groundstation0)
   deleted: (pointing satellite0 groundstation0)
   added: (pointing satellite0 phenomenon5)
   changed: (fuel satellite0) from 37.153 to 26.803, (fuel-used) from 113.847 to 124.197
   goals met: 2 of 4
13. (take_image satellite0 phenomenon5 instrument0 thermograph0)
   added: (have_image phenomenon5 thermograph0)
   changed: (data_capacity satellite0) from 716 to 536, (data-stored) from 284 to 464
   goals met: 3 of 4
14. (turn_to satellite0 groundstation0 phenomenon5)
   deleted: (pointing satellite0 phenomenon5)
   added: (pointing satellite0 groundstation0)
   changed: (fuel satellite0) from 26.803 to 16.453, (fuel-used) from 124.197 to 134.547
   goals met: 3 of 4
15. (turn_to satellite0 star2 groundstation0)
   deleted: (pointing satellite0 groundstation0)
   added: (pointing satellite0 star2)
   changed: (fuel satellite0) from 16.453 to 12.099, (fuel-used) from 134.547 to 138.901
   goals met: 3 of 4
16. (turn_to satellite0 star7 star2)
   deleted: (pointing satellite0 star2)
   added: (pointing satellite0 star7)
   changed: (fuel satellite0) from 12.099 to 8.378, (fuel-used) from 138.901 to 142.622
   goals met: 3 of 4
17. (take_image satellite0 star7 instrument0 thermograph0)
   added: (have_image star7 thermograph0)
   changed: (data_capacity satellite0) from 536 to 417, (data-stored) from 464 to 583
   goals met: 4 of 4
